[net]
batch=128
subdivisions=1
height=227
width=227
channels=3
momentum=0.9
decay=0.0005
max_crop=256

learning_rate=0.01
policy=poly
power=4
max_batches=$num_max_batches

hue=0
saturation=0
flip=$flip
angle=$angle
exposure=$exposure
aspect=$aspect

[convolutional]
filters=96
size=11
stride=4
pad=0
activation=relu

[maxpool]
size=3
stride=2
padding=0

[convolutional]
filters=256
size=5
stride=1
pad=1
activation=relu

[maxpool]
size=3
stride=2
padding=0

[convolutional]
filters=384
size=3
stride=1
pad=1
activation=relu

[convolutional]
filters=384
size=3
stride=1
pad=1
activation=relu

[convolutional]
filters=256
size=3
stride=1
pad=1
activation=relu

[maxpool]
size=3
stride=2
padding=0

[connected]
output=$num_connected
activation=relu

[dropout]
probability=.5

[connected]
output=$num_connected
activation=relu

[dropout]
probability=.5

[connected]
output=$num_classes
activation=linear

[softmax]
groups=1
